<?php
// Данные о новостях (в реальном проекте подгружаются из БД)
$news = [
    [
        'author' => 'Иван Иванов',
        'avatar' => 'avatar.jpg',
         'date' => '2024-07-26 10:00',
         'text' => 'Всем привет! Сегодня отличный день!',
        'likes' => 15,
    ],
     [
        'author' => 'Мария Петрова',
        'avatar' => 'avatar.jpg',
         'date' => '2024-07-26 12:00',
         'text' => 'Посмотрите какая красота! ',
          'image' => 'https://source.unsplash.com/random/300x200',
         'likes' => 150,

    ],
    [
        'author' => 'Сергей Смирнов',
        'avatar' => 'avatar.jpg',
         'date' => '2024-07-26 14:00',
         'text' => 'Занимаюсь разработкой нового проекта!',
         'likes' => 25,
    ],
];
?>
